David-OConnor/stm32-hal/src/timer.rs
// todo: Which use apb1, and which use apb2? We have a good start, but needs QC
// todo: Feature-gate f562.

#[cfg(not(feature = "stm32f373"))]
hal! {
    {
        TIM1: (tim1, tim1en, tim1rst, apb2_timer),
    },
}

#[cfg(not(feature = "stm32f552"))]
hal! {
    {
        TIM3: (tim3, tim3en, tim3rst, apb1_timer),
    },
}

#[cfg(not(any(
    feature = "stm32l4x1",
    feature = "stm32l4x2",
    feature = "stm32l4x3",
    feature = "stm32l552"
)))]
hal! {
    {
        TIM4: (tim4, tim4en, tim4rst, apb1_timer),
    },
    {
        TIM17: (tim17, tim17en, tim17rst, apb2_timer),
    },
}

#[cfg(any(
    feature = "stm32f301",
    feature = "stm32f373",
    feature = "stm32l4x5",
    feature = "stm32l4x6",
    feature = "stm32l562"
))]
hal! {
    {
        TIM5: (tim5, tim56en, tim5rst, apb1_timer),
    },
}

hal! {
    {
        TIM2: (tim2, tim2en, tim2rst, apb1_timer),
    },
    {
        TIM6: (tim6, tim6en, tim6rst, apb1_timer),
    },
        {
        TIM7: (tim7, tim7en, tim7rst, apb1_timer),
    },
    {
        TIM15: (tim15, tim15en, tim15rst, apb2_timer),
    },
    {
        TIM16: (tim16, tim16en, tim16rst, apb2_timer),
    },
}

#[cfg(any(
    feature = "stm32f302",
    feature = "stm32f303",
    feature = "stm32l4x5",
    feature = "stm32l4x6",
    feature = "stm32l562",
))]
hal! {
    {
        TIM8: (tim8, tim8en, tim8rst, apb2_timer),
    },
}

#[cfg(feature = "stm32f373")]
hal! {
    {
        TIM10: (tim10, tim10en, tim10rst, apb2_timer),
    },
}

#[cfg(any(feature = "stm32f301", feature = "stm32f373"))]
hal! {
    {
        TIM12: (tim12, tim12en, tim12rst, apb1_timer),
    },
    {
        TIM13: (tim13, tim13en, tim13rst, apb1_timer),
    },
        {
        TIM14: (tim14, tim14en, tim14rst, apb1_timer),
    },
    {
        TIM19: (tim19, tim19en, tim19rst, , apb2_timer),
    }
}

#[cfg(any(feature = "stm32f302", feature = "stm32f373"))]
hal! {
    {
        TIM18: (tim18, tim18en, tim18rst, apb2_timer),
    },
        {
        TIM20: (tim20, tim20en, tim20rst, apb2_timer),
    },
}

// pwm_features! {
//     {
//         TIM2: (tim2, tim2en, tim2rst, apb1_timer),
//         u32,
//     },
//     {
//         TIM3: (tim3, tim3en, tim3rst, apb1_timer),
//         u16,
//     },
//     {
//         TIM4: (tim4, tim4en, tim4rst, apb1_timer),
//         u16,
//     },
// }
